/* Rexx */
/*
version 1, unnormalized
The numbers can be any valid REXX number (integer, fixed point decimal, floating point (with exponential notation, ...).
*/

parse pull a b
say a+b

