/* Rexx */
/*
version 3, extended precision
Using the numeric digits statement allows more digits to be used, the default is 9.
*/

numeric digits 300
parse pull a b
z=(a+b)/1
say z

